--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]
local function run(msg, matches)

  if matches[1] == 'الاوامر' then

local texts = [[

<b>welcome in smilev3 💎</b>
<b>كليشه المعلومات المساعده 💡</b>

<b>
م1 ➖ لعرض اوامر القفل للمجموعه
م2 ➖ لعرض اوامر الرفع
م3 ➖ لعرض خواص البوت

→→→→⚙️SV3→→→→📚
S M I L E ➖ T E A M
</b>
👨🏻‍💻 <b>Dev</b> ➣ @iq_100k
👨🏻‍💻 <b>Dev</b> ➣ @b_s_r 
📚 <b>CH</b>➣ @porgramer2017
]]
  tg.sendMessage(msg.chat_id_, 0, 1, texts, 1, 'html')

 end

  if matches[1] == 'م1' then

local texts = [[
<b>welcome again in sv3 💎</b>
<b>
مرحبا بك في اوامر القفل ل SV3🕴🏻

⚙️ قفل / فتح ➖ الروابط
⚙️ قفل / فتح ➖ اليوزر
⚙️ قفل / فتح ➖ التعديل
⚙️ قفل / فتح ➖ التوجيه
⚙️ قفل / فتح ➖ التكرار
⚙️ قفل / فتح ➖ الملصقات
⚙️ قفل / فتح ➖ الانكليزيه
⚙️ قفل / فتح ➖ الفارسيه
⚙️ قفل / فتح ➖ الاشعارت
⚙️ قفل / فتح ➖ الاشاره
⚙️ قفل / فتح ➖ الانلاين
⚙️ قفل / فتح ➖ الاعدادات
⚙️ اقفل / افتح ➖ الدردشه
⚙️ اقفل / افتح ➖ الكتابه
⚙️ اقفل / افتح ➖ الصور
⚙️اقفل / افتح ➖ الفيديو
⚙️️ اقفل / افتح ➖ البصمه
⚙️ اقفل / افتح ➖ الملفات
⚙️ اقفل / افتح ➖ الصوتيات
⚙️ اقفل / افتح ➖ المتحركه


→→→→⚙️SV3→→→→📚
S M I L E ➖ T E A M
</b>
👨🏻‍💻 <b>Dev</b> ➣ @iq_100k
👨🏻‍💻 <b>Dev</b> ➣ @b_s_r 
📚 <b>CH</b>➣ @porgramer2017
]]
  tg.sendMessage(msg.chat_id_, 0, 1, texts, 1, 'html')

end

  
  if matches[1] == 'م2' then

local texts = [[
<b>اوامر الرفع للمجموعه 🌐</b>

<b>

رفع مدير ➖ لرفع مدير للمجموعه
رفع ادمن ➖ لرفع ادمن للمجموعه
تخفيض ➖ لتخفيض ادمن او مدير

→→→→⚙️SV3→→→→📚
S M I L E ➖ T E A M
</b>
👨🏻‍💻 <b>Dev</b> ➣ @iq_100k
👨🏻‍💻 <b>Dev</b> ➣ @b_s_r 
📚 <b>CH</b>➣ @porgramer2017
]]
  tg.sendMessage(msg.chat_id_, 0, 1, texts, 1, 'html')

end


if matches[1] == 'م3' then

local texts = [[
<b>مرحبا بك في كليشه ⚙️ العامه</b>

<b>
1️⃣ لعرض الطقس اكتب كلاتي :

طقس+ اسم محافضتك مثال :

طقس البصره 💡

2️⃣ لنشر منشور في جميع مجموعات البوت يرجى كتابه نشر او اذاعه والجمله المراد نشرها 💡

3️⃣ لمسح جميع الرسائل يرجى كتابه حذف الرسائل 🗑

4️⃣ لحذف رد معين يرجى كتابه مسح بلرد للكلام الذي تود حذفه

5️⃣ لعرض ايديك يرجى كتابه ايدي

6️⃣ لرفع مدير للمجموعه يرجى كتابه رفع مدير بلرد او بلمعرف 🚹

7️⃣ لرفع ادمن للمجموعه يرجى كتابه رفع ادمن بلرد او بلمعرف 📶

8️⃣ لتخفيض ادمن او مدير يرجى كتابه تخفيض بلرد او بلمعرف 🌀

9⃣ لاضافه قوانين يرجى كتابه اضف قوانين + القوانين المراد وضعها ولعرض القوانين يرجى كتابه القوانين

🔟 لاضافه ملاحضه يرجى كتابه اضف ملاحضه + الملاحضه المراد وضعها ولعرض الملاحضه يرجى كتابه الملاحضه لعرضها لك في حال وجودها 

1️⃣1️⃣ لتثبيت رساله يرجى ارسال كلمه تثبيت بلرد

1️⃣2️⃣ لالغاء تثبيت الرساله يرجى ارسال كلمه الغاء بلرد للرساله المثبته

→→→→⚙️SV3→→→→📚
S M I L E ➖ T E A M
</b>
👨🏻‍💻 <b>Dev</b> ➣ @iq_100k
👨🏻‍💻 <b>Dev</b> ➣ @b_s_r 
📚 <b>CH</b>➣ @porgramer2017
]]
  tg.sendMessage(msg.chat_id_, 0, 1, texts, 1, 'html')

 end

    end

return {

  patterns = {

    "^(الاوامر)$",
    "^(م1)$",
    "^(م3)$",
    "^(م2)$",
  },

  run = run

}
