--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]
local function run(msg, matches)
local group = load_data('bot/group.json')
if matches[1] == 'ضع رابط' and is_owner(msg) or is_momod(msg) and addgroup then
redis:set('الرابط'..msg.chat_id_,matches[2])
tg.sendMessage(msg.chat_id_, 0, 1, '<b> 🈂 تم حفض الرابط بنجاح</b>', 1, 'html')
end
if matches[2] == 'الرابط' and is_owner(msg) or is_momod(msg) then
link1 = redis:get('الرابط'..msg.chat_id_)
tg.sendMessage(msg.chat_id_, 0, 1, '<b>رابط المجموعه ☃ :</b>\n'..link1 , 1, 'html')
end
end

return {
  patterns = {
"^(ضع رابط) (.*)$",
"^(الرابط)$"
 },
  run = run
}
--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]
