do local _ = {
  enabled_plugins = {
    "tools",
    "share",
    "supergroup",
    "msg_checks",
    "pin",
    "start",
    "id",
    "delmsg",
    "cleanallmsg",
    "setlink",
    "setrules",
    "meme",
    "help",
    "reply",  
    "wether"  
  },
  group  = {
    data = "bot/group.json"
  },
  sudo_users = {
    115124695, -- ايديات المطورين هنا 
    340447669,
    0
  },
robot = {
    259520808,-- ايدي البوت هنا 
    0
  }
}
return _
end

--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]
